# About this project

This project aims to demonstrate the use of SQL to answer hypothetical sales and marketing questions about a DVD rental store with a MySQL database named Sakila.

# Sakila Database

The Sakila database is a nicely normalised schema modelling a DVD rental store, featuring things like films, actors, film-actor relationships, and a central inventory table that connects films, stores, and rentals.

The Sakila MySQL sample database is available from http://dev.mysql.com/doc/index-other.html. 


## Sakila Database Entity Relationship Diagram(ERD)

<img src="https://www.jooq.org/img/sakila.png">

## Problem Description

- **Store performance**:
    - Which is the most popular store?
    - What is the total revenue of all of the stores?
    - Which store makes the most money? 
    
    
- **Consumer behavior**:
    - What are the most popular films that customers rent?
    - What is the average rental duration?
    - Which genres are most popular? 
    - If we want to hire an actor to do ads for us. Which actor is in the most films?
    - If we want to hire an actor to do ads for us. Which actors/actresses are most popular given our rental history?
    - Given the films customers have rented, which new ones should we suggest to them?
    - Who are identify loyalty customers?
    
    
- **Inventory summary**:
    - Track the inventory level and determine whether the rental can happen????????????
    
    
- **Sales summary**:
    - Do we make the most money from long or short rentals?
    - Monitor customers’ owing balance and find overdue DVDs ???????????


## Tables
- Product information: 
    - Involving table film, language, actor, film_actor, film_category, category
- Inventory information: 
    - Involving table inventory, store, address,
- Sales information:
    - Involving table rental, payment
- Customer behavior information: 
    - Involcing table rental, customer, city, country

In [1]:
# pip install ipython-sql

In [2]:
# pip install pymysql

In [3]:
# Loading the SQL module
%load_ext sql

In [4]:
# Connect to database
%sql mysql+pymysql://root:123456@localhost/sakila

## Explore product related tables

### FILM table

In [5]:
%%sql
describe film

 * mysql+pymysql://root:***@localhost/sakila
13 rows affected.

[('film_id', 'smallint unsigned', 'NO', 'PRI', None, 'auto_increment'),
 ('title', 'varchar(128)', 'NO', 'MUL', None, ''),
 ('description', 'text', 'YES', '', None, ''),
 ('release_year', 'year', 'YES', '', None, ''),
 ('language_id', 'tinyint unsigned', 'NO', 'MUL', None, ''),
 ('original_language_id', 'tinyint unsigned', 'YES', 'MUL', None, ''),
 ('rental_duration', 'tinyint unsigned', 'NO', '', '3', ''),
 ('rental_rate', 'decimal(4,2)', 'NO', '', '4.99', ''),
 ('length', 'smallint unsigned', 'YES', '', None, ''),
 ('replacement_cost', 'decimal(5,2)', 'NO', '', '19.99', ''),
 ('rating', "enum('G','PG','PG-13','R','NC-17')", 'YES', '', 'G', ''),
 ('special_features', "set('Trailers','Commentaries','Deleted Scenes','Behind the Scenes')", 'YES', '', None, ''),
 ('last_update', 'timestamp', 'NO', '', 'CURRENT_TIMESTAMP', 'DEFAULT_GENERATED on update CURRENT_TIMESTAMP')]

In [6]:
%%sql
# What is the largest rental_rate for each rating?

select rating, max(rental_rate) largest_rate
from film
group by rating;

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('PG', Decimal('4.99')),
 ('G', Decimal('4.99')),
 ('NC-17', Decimal('4.99')),
 ('PG-13', Decimal('4.99')),
 ('R', Decimal('4.99'))]

In [7]:
%%sql
# How many films in each rating category?

select rating, count(film_id) num_of_film
from film
group by rating

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('PG', 194), ('G', 178), ('NC-17', 210), ('PG-13', 223), ('R', 195)]

In [8]:
%%sql
# Create a new column film_length to segment different films by length:
# length < 60 then ‘short’; length < 120 then standard’; length >=120 then ‘long’, 
# then count the number of films in each segment.

select case 
    when length <60 then 'Short'
    when length <120 then 'Standard'
    when length >=120 then 'Long'
    end as film_length,
    count(film_id) num_of_film
from film
group by film_length

 * mysql+pymysql://root:***@localhost/sakila
3 rows affected.

[('Standard', 438), ('Short', 96), ('Long', 466)]

In [9]:
%%sql
# Find language name for each film

select title, name
from film f
left join language l
on f.language_id = l.language_id
limit 5

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('ACADEMY DINOSAUR', 'English'),
 ('ACE GOLDFINGER', 'English'),
 ('ADAPTATION HOLES', 'English'),
 ('AFFAIR PREJUDICE', 'English'),
 ('AFRICAN EGG', 'English')]

###  ACTOR table

In [10]:
%%sql
describe actor

 * mysql+pymysql://root:***@localhost/sakila
4 rows affected.

[('actor_id', 'smallint unsigned', 'NO', 'PRI', None, 'auto_increment'),
 ('first_name', 'varchar(45)', 'NO', '', None, ''),
 ('last_name', 'varchar(45)', 'NO', 'MUL', None, ''),
 ('last_update', 'timestamp', 'NO', '', 'CURRENT_TIMESTAMP', 'DEFAULT_GENERATED on update CURRENT_TIMESTAMP')]

In [11]:
%%sql
# Which actors have the last name ‘Johansson’

select actor_id, first_name, last_name
from actor
where last_name = 'Johansson'

 * mysql+pymysql://root:***@localhost/sakila
3 rows affected.

[(8, 'MATTHEW', 'JOHANSSON'),
 (64, 'RAY', 'JOHANSSON'),
 (146, 'ALBERT', 'JOHANSSON')]

In [12]:
%%sql
# Add a column showing actor full name with only first letter of first name and last name capitalize

select *,
concat(concat(upper(left(first_name, 1)), lower(substr(first_name, 2, length(first_name)))), ' ', concat(upper(left(last_name, 1)), lower(substr(last_name, 2, length(last_name))))) full_name
from actor
limit 10

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[(1, 'PENELOPE', 'GUINESS', datetime.datetime(2006, 2, 15, 4, 34, 33), 'Penelope Guiness'),
 (2, 'NICK', 'WAHLBERG', datetime.datetime(2006, 2, 15, 4, 34, 33), 'Nick Wahlberg'),
 (3, 'ED', 'CHASE', datetime.datetime(2006, 2, 15, 4, 34, 33), 'Ed Chase'),
 (4, 'JENNIFER', 'DAVIS', datetime.datetime(2006, 2, 15, 4, 34, 33), 'Jennifer Davis'),
 (5, 'JOHNNY', 'LOLLOBRIGIDA', datetime.datetime(2006, 2, 15, 4, 34, 33), 'Johnny Lollobrigida'),
 (6, 'BETTE', 'NICHOLSON', datetime.datetime(2006, 2, 15, 4, 34, 33), 'Bette Nicholson'),
 (7, 'GRACE', 'MOSTEL', datetime.datetime(2006, 2, 15, 4, 34, 33), 'Grace Mostel'),
 (8, 'MATTHEW', 'JOHANSSON', datetime.datetime(2006, 2, 15, 4, 34, 33), 'Matthew Johansson'),
 (9, 'JOE', 'SWANK', datetime.datetime(2006, 2, 15, 4, 34, 33), 'Joe Swank'),
 (10, 'CHRISTIAN', 'GABLE', datetime.datetime(2006, 2, 15, 4, 34, 33), 'Christian Gable')]

In [13]:
%%sql
# How many distinct actors’ last names are there?

select count(distinct last_name) num_of_last_name
from actor

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(121,)]

In [14]:
%%sql 
# Which last names are not repeated? 

select last_name
from actor
group by last_name
having count(last_name) = 1
limit 5

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('ASTAIRE',), ('BACALL',), ('BALE',), ('BALL',), ('BARRYMORE',)]

In [15]:
%%sql
# Which last names appear more than once?

select last_name
from actor
group by last_name
having count(last_name) >1
limit 5

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('AKROYD',), ('ALLEN',), ('BAILEY',), ('BENING',), ('BERRY',)]

### FILM_ACTOR table

In [16]:
%%sql
describe film_actor

 * mysql+pymysql://root:***@localhost/sakila
3 rows affected.

[('actor_id', 'smallint unsigned', 'NO', 'PRI', None, ''),
 ('film_id', 'smallint unsigned', 'NO', 'PRI', None, ''),
 ('last_update', 'timestamp', 'NO', '', 'CURRENT_TIMESTAMP', 'DEFAULT_GENERATED on update CURRENT_TIMESTAMP')]

In [17]:
%%sql
# Count the number of actors in each film, order the result by the number of actors with descending order

select title, count(actor_id) num_of_actor
from film_actor fa
join film f
on fa.film_id = f.film_id
group by title
order by num_of_actor desc
limit 5

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('LAMBS CINCINATTI', 15),
 ('CRAZY HOME', 13),
 ('DRACULA CRYSTAL', 13),
 ('CHITTY LOCK', 13),
 ('BOONDOCK BALLROOM', 13)]

In [18]:
%%sql 
# How many films each actor played in?

select first_name, last_name, count(film_id) num_of_film
from film_actor fa
join actor a
on fa.actor_id = a.actor_id
group by first_name, last_name
order by num_of_film desc
limit 5

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('SUSAN', 'DAVIS', 54),
 ('GINA', 'DEGENERES', 42),
 ('WALTER', 'TORN', 41),
 ('MARY', 'KEITEL', 40),
 ('MATTHEW', 'CARREY', 39)]

In [19]:
%%sql
# What's the actor name for each actor_id, and film tile for each film_id. 

select fa.actor_id, first_name, last_name, fa.film_id, title
from film_actor fa
join film f on fa.film_id = f.film_id
join actor a on fa.actor_id = a.actor_id
limit 5

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[(1, 'PENELOPE', 'GUINESS', 1, 'ACADEMY DINOSAUR'),
 (1, 'PENELOPE', 'GUINESS', 23, 'ANACONDA CONFESSIONS'),
 (1, 'PENELOPE', 'GUINESS', 25, 'ANGELS LIFE'),
 (1, 'PENELOPE', 'GUINESS', 106, 'BULWORTH COMMANDMENTS'),
 (1, 'PENELOPE', 'GUINESS', 140, 'CHEAPER CLYDE')]

In [20]:
%%sql 
# In table Film, which category each film belongs to?

select title, c.name category_name
from film f
left join film_category fc
on f.film_id = fc.film_id
left join category c
on fc.category_id = c.category_id
order by category_name
limit 5

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('AMERICAN CIRCUS', 'Action'),
 ('ARK RIDGEMONT', 'Action'),
 ('BAREFOOT MANCHURIAN', 'Action'),
 ('ANTITRUST TOMATOES', 'Action'),
 ('AMADEUS HOLY', 'Action')]

In [21]:
%%sql
# Which films have rental_rate > 2 and rating G, PG-13 or PG. 

select title, rental_rate, rating
from film
where rental_rate>2 and rating in ('G','PG-13','PG')
limit 5

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('ACE GOLDFINGER', Decimal('4.99'), 'G'),
 ('AFFAIR PREJUDICE', Decimal('2.99'), 'G'),
 ('AFRICAN EGG', Decimal('2.99'), 'G'),
 ('AGENT TRUMAN', Decimal('2.99'), 'PG'),
 ('AIRPLANE SIERRA', Decimal('4.99'), 'PG-13')]

## Sales information

In [22]:
%%sql
# How many rentals happened from 2005-05 to 2005-08?

select count(rental_id) num_of_rental
from rental
where rental_date between '2005-05-01' and '2005-08-31'

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(15862,)]

In [23]:
%%sql
# What's the rental amount by month?

select substr(rental_date, 1, 7) month, count(rental_id) num_of_rental
from rental
group by month

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('2005-05', 1156),
 ('2005-06', 2311),
 ('2005-07', 6709),
 ('2005-08', 5686),
 ('2006-02', 182)]

In [24]:
%%sql
# Rank the staff by total rental volumes for all time period

select first_name, last_name, count(rental_id) num_of_rental
from rental r
join staff s
on r.staff_id = s.staff_id
group by first_name, last_name

 * mysql+pymysql://root:***@localhost/sakila
2 rows affected.

[('Mike', 'Hillyer', 8040), ('Jon', 'Stephens', 8004)]

## Inventory information

In [25]:
%%sql
# What's the inventory level report for each film in each store?

select title, store_id, count(inventory_id) num_of_inventory
from inventory i
left join film f
on i.film_id = f.film_id
group by title, store_id
order by title
limit 5

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('ACADEMY DINOSAUR', 1, 4),
 ('ACADEMY DINOSAUR', 2, 4),
 ('ACE GOLDFINGER', 2, 3),
 ('ADAPTATION HOLES', 2, 4),
 ('AFFAIR PREJUDICE', 1, 4)]

In [26]:
%%sql
# What's the inventory level report for each film in each store, incluidng category information for each film
select title, store_id, c.name, count(inventory_id) num_of_inventory
from inventory i
left join film f
on i.film_id = f.film_id
left join film_category fc
on f.film_id = fc.film_id
left join category c
on c.category_id = fc.category_id
group by title, store_id, c.name
order by title
limit 5

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('ACADEMY DINOSAUR', 1, 'Documentary', 4),
 ('ACADEMY DINOSAUR', 2, 'Documentary', 4),
 ('ACE GOLDFINGER', 2, 'Horror', 3),
 ('ADAPTATION HOLES', 2, 'Documentary', 4),
 ('AFFAIR PREJUDICE', 1, 'Horror', 4)]

In [27]:
%%sql
# Create a table to save the above qurery result

create table inventory_summary as
select i.film_id, title, store_id, c.name, count(inventory_id) num_of_inventory
from inventory i
left join film f
on i.film_id = f.film_id
left join film_category fc
on f.film_id = fc.film_id
left join category c
on c.category_id = fc.category_id
group by i.film_id, title, store_id, c.name
order by title

 * mysql+pymysql://root:***@localhost/sakila
(pymysql.err.OperationalError) (1050, "Table 'inventory_summary' already exists")
[SQL: # Create a table to save the above qurery result

create table inventory_summary as
select i.film_id, title, store_id, c.name, count(inventory_id) num_of_inventory
from inventory i
left join film f
on i.film_id = f.film_id
left join film_category fc
on f.film_id = fc.film_id
left join category c
on c.category_id = fc.category_id
group by i.film_id, title, store_id, c.name
order by title]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [28]:
%%sql
# Use the inventory summary report to identify the film which is not available in any store, 

select f.film_id, title
from film f
where f.film_id not in (select ins.film_id from inventory_summary ins)
limit 5

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[(14, 'ALICE FANTASIA'),
 (33, 'APOLLO TEEN'),
 (36, 'ARGONAUTS TOWN'),
 (38, 'ARK RIDGEMONT'),
 (41, 'ARSENIC INDEPENDENCE')]

## Revenue

In [29]:

# -The payment table records each payment made by a customer, with information such as the amount and the rental being paid for. Let us consider the payment amount as revenue and ignore the receivable revenue part
# -rental_id: The rental that the payment is being applied to. This is optional because some payments are for outstanding fees and may not be directly related to a rental – which means it can be null;

# 9.How much revenues made from 2005-05 to 2005-08 by month?


# 10.How much revenues made from 2005-05 to 2005-08 by each store?


# 11.Say the movie r`ental store wants to offer unpopular movies for sale to free up shelf space for newer ones. Help the store to identify unpopular movies by counting the number of rental times for each film. Provide the film id, film name, category name so the store can also know which categories are not popular. Hint: count how many times each film was checked out and rank the result by ascending order.

In [30]:
%%sql 

select * 
from sales_by_store

 * mysql+pymysql://root:***@localhost/sakila
2 rows affected.

[('Woodridge,Australia', 'Jon Stephens', Decimal('33726.77')),
 ('Lethbridge,Canada', 'Mike Hillyer', Decimal('33679.79'))]